SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG28/Include/efr32fg28_smu.h
/* Bit fields for SMU BMPUPATD0 */
#define _SMU_BMPUPATD0_RESETVALUE                0x000001FFUL                                 /**< Default value for SMU_BMPUPATD0             */
#define _SMU_BMPUPATD0_MASK                      0x000001FFUL                                 /**< Mask for SMU_BMPUPATD0                      */
#define SMU_BMPUPATD0_RADIOAES                   (0x1UL << 0)                                 /**< RADIO AES DMA privileged mode               */
#define _SMU_BMPUPATD0_RADIOAES_SHIFT            0                                            /**< Shift value for SMU_RADIOAES                */
#define _SMU_BMPUPATD0_RADIOAES_MASK             0x1UL                                        /**< Bit mask for SMU_RADIOAES                   */
#define _SMU_BMPUPATD0_RADIOAES_DEFAULT          0x00000001UL                                 /**< Mode DEFAULT for SMU_BMPUPATD0              */
#define SMU_BMPUPATD0_RADIOAES_DEFAULT           (_SMU_BMPUPATD0_RADIOAES_DEFAULT << 0)       /**< Shifted mode DEFAULT for SMU_BMPUPATD0      */
#define SMU_BMPUPATD0_RADIOSUBSYSTEM             (0x1UL << 1)                                 /**< RADIO subsystem manager privileged mode     */
#define _SMU_BMPUPATD0_RADIOSUBSYSTEM_SHIFT      1                                            /**< Shift value for SMU_RADIOSUBSYSTEM          */
#define _SMU_BMPUPATD0_RADIOSUBSYSTEM_MASK       0x2UL                                        /**< Bit mask for SMU_RADIOSUBSYSTEM             */
#define _SMU_BMPUPATD0_RADIOSUBSYSTEM_DEFAULT    0x00000001UL                                 /**< Mode DEFAULT for SMU_BMPUPATD0              */
#define SMU_BMPUPATD0_RADIOSUBSYSTEM_DEFAULT     (_SMU_BMPUPATD0_RADIOSUBSYSTEM_DEFAULT << 1) /**< Shifted mode DEFAULT for SMU_BMPUPATD0      */
#define SMU_BMPUPATD0_LDMA                       (0x1UL << 2)                                 /**< MCU LDMA privileged mode                    */
#define _SMU_BMPUPATD0_LDMA_SHIFT                2                                            /**< Shift value for SMU_LDMA                    */
#define _SMU_BMPUPATD0_LDMA_MASK                 0x4UL                                        /**< Bit mask for SMU_LDMA                       */
#define _SMU_BMPUPATD0_LDMA_DEFAULT              0x00000001UL                                 /**< Mode DEFAULT for SMU_BMPUPATD0              */
#define SMU_BMPUPATD0_LDMA_DEFAULT               (_SMU_BMPUPATD0_LDMA_DEFAULT << 2)           /**< Shifted mode DEFAULT for SMU_BMPUPATD0      */
#define SMU_BMPUPATD0_MVPAHBDATA0                (0x1UL << 3)                                 /**< MVPAHBDATA0 privileged mode                 */
#define _SMU_BMPUPATD0_MVPAHBDATA0_SHIFT         3                                            /**< Shift value for SMU_MVPAHBDATA0             */
#define _SMU_BMPUPATD0_MVPAHBDATA0_MASK          0x8UL                                        /**< Bit mask for SMU_MVPAHBDATA0                */
#define _SMU_BMPUPATD0_MVPAHBDATA0_DEFAULT       0x00000001UL                                 /**< Mode DEFAULT for SMU_BMPUPATD0              */
#define SMU_BMPUPATD0_MVPAHBDATA0_DEFAULT        (_SMU_BMPUPATD0_MVPAHBDATA0_DEFAULT << 3)    /**< Shifted mode DEFAULT for SMU_BMPUPATD0      */
#define SMU_BMPUPATD0_MVPAHBDATA1                (0x1UL << 4)                                 /**< MVPAHBDATA1 privileged mode                 */
#define _SMU_BMPUPATD0_MVPAHBDATA1_SHIFT         4                                            /**< Shift value for SMU_MVPAHBDATA1             */
#define _SMU_BMPUPATD0_MVPAHBDATA1_MASK          0x10UL                                       /**< Bit mask for SMU_MVPAHBDATA1                */
#define _SMU_BMPUPATD0_MVPAHBDATA1_DEFAULT       0x00000001UL                                 /**< Mode DEFAULT for SMU_BMPUPATD0              */
#define SMU_BMPUPATD0_MVPAHBDATA1_DEFAULT        (_SMU_BMPUPATD0_MVPAHBDATA1_DEFAULT << 4)    /**< Shifted mode DEFAULT for SMU_BMPUPATD0      */
#define SMU_BMPUPATD0_MVPAHBDATA2                (0x1UL << 5)                                 /**< MVPAHBDATA2 privileged mode                 */
#define _SMU_BMPUPATD0_MVPAHBDATA2_SHIFT         5                                            /**< Shift value for SMU_MVPAHBDATA2             */
#define _SMU_BMPUPATD0_MVPAHBDATA2_MASK          0x20UL                                       /**< Bit mask for SMU_MVPAHBDATA2                */
#define _SMU_BMPUPATD0_MVPAHBDATA2_DEFAULT       0x00000001UL                                 /**< Mode DEFAULT for SMU_BMPUPATD0              */
#define SMU_BMPUPATD0_MVPAHBDATA2_DEFAULT        (_SMU_BMPUPATD0_MVPAHBDATA2_DEFAULT << 5)    /**< Shifted mode DEFAULT for SMU_BMPUPATD0      */
#define SMU_BMPUPATD0_RFECA0                     (0x1UL << 6)                                 /**< RFECA0 privileged mode                      */
#define _SMU_BMPUPATD0_RFECA0_SHIFT              6                                            /**< Shift value for SMU_RFECA0                  */
#define _SMU_BMPUPATD0_RFECA0_MASK               0x40UL                                       /**< Bit mask for SMU_RFECA0                     */
#define _SMU_BMPUPATD0_RFECA0_DEFAULT            0x00000001UL                                 /**< Mode DEFAULT for SMU_BMPUPATD0              */
#define SMU_BMPUPATD0_RFECA0_DEFAULT             (_SMU_BMPUPATD0_RFECA0_DEFAULT << 6)         /**< Shifted mode DEFAULT for SMU_BMPUPATD0      */
#define SMU_BMPUPATD0_RFECA1                     (0x1UL << 7)                                 /**< RFECA1 privileged mode                      */
#define _SMU_BMPUPATD0_RFECA1_SHIFT              7                                            /**< Shift value for SMU_RFECA1                  */
#define _SMU_BMPUPATD0_RFECA1_MASK               0x80UL                                       /**< Bit mask for SMU_RFECA1                     */
#define _SMU_BMPUPATD0_RFECA1_DEFAULT            0x00000001UL                                 /**< Mode DEFAULT for SMU_BMPUPATD0              */
#define SMU_BMPUPATD0_RFECA1_DEFAULT             (_SMU_BMPUPATD0_RFECA1_DEFAULT << 7)         /**< Shifted mode DEFAULT for SMU_BMPUPATD0      */
#define SMU_BMPUPATD0_SEEXTDMA                   (0x1UL << 8)                                 /**< SEEXTDMA privileged mode                    */
#define _SMU_BMPUPATD0_SEEXTDMA_SHIFT            8                                            /**< Shift value for SMU_SEEXTDMA                */
#define _SMU_BMPUPATD0_SEEXTDMA_MASK             0x100UL                                      /**< Bit mask for SMU_SEEXTDMA                   */
#define _SMU_BMPUPATD0_SEEXTDMA_DEFAULT          0x00000001UL                                 /**< Mode DEFAULT for SMU_BMPUPATD0              */
#define SMU_BMPUPATD0_SEEXTDMA_DEFAULT           (_SMU_BMPUPATD0_SEEXTDMA_DEFAULT << 8)       /**< Shifted mode DEFAULT for SMU_BMPUPATD0      */

/* Bit fields for SMU BMPUSATD0 */
#define _SMU_BMPUSATD0_RESETVALUE                0x000001FFUL                                 /**< Default value for SMU_BMPUSATD0             */
#define _SMU_BMPUSATD0_MASK                      0x000001FFUL                                 /**< Mask for SMU_BMPUSATD0                      */
#define SMU_BMPUSATD0_RADIOAES                   (0x1UL << 0)                                 /**< RADIOAES DMA secure mode                    */
#define _SMU_BMPUSATD0_RADIOAES_SHIFT            0                                            /**< Shift value for SMU_RADIOAES                */
#define _SMU_BMPUSATD0_RADIOAES_MASK             0x1UL                                        /**< Bit mask for SMU_RADIOAES                   */
#define _SMU_BMPUSATD0_RADIOAES_DEFAULT          0x00000001UL                                 /**< Mode DEFAULT for SMU_BMPUSATD0              */
#define SMU_BMPUSATD0_RADIOAES_DEFAULT           (_SMU_BMPUSATD0_RADIOAES_DEFAULT << 0)       /**< Shifted mode DEFAULT for SMU_BMPUSATD0      */
#define SMU_BMPUSATD0_RADIOSUBSYSTEM             (0x1UL << 1)                                 /**< RADIO subsystem manager secure mode         */
#define _SMU_BMPUSATD0_RADIOSUBSYSTEM_SHIFT      1                                            /**< Shift value for SMU_RADIOSUBSYSTEM          */
#define _SMU_BMPUSATD0_RADIOSUBSYSTEM_MASK       0x2UL                                        /**< Bit mask for SMU_RADIOSUBSYSTEM             */
#define _SMU_BMPUSATD0_RADIOSUBSYSTEM_DEFAULT    0x00000001UL                                 /**< Mode DEFAULT for SMU_BMPUSATD0              */
#define SMU_BMPUSATD0_RADIOSUBSYSTEM_DEFAULT     (_SMU_BMPUSATD0_RADIOSUBSYSTEM_DEFAULT << 1) /**< Shifted mode DEFAULT for SMU_BMPUSATD0      */
#define SMU_BMPUSATD0_LDMA                       (0x1UL << 2)                                 /**< MCU LDMA secure mode                        */
#define _SMU_BMPUSATD0_LDMA_SHIFT                2                                            /**< Shift value for SMU_LDMA                    */
#define _SMU_BMPUSATD0_LDMA_MASK                 0x4UL                                        /**< Bit mask for SMU_LDMA                       */
#define _SMU_BMPUSATD0_LDMA_DEFAULT              0x00000001UL                                 /**< Mode DEFAULT for SMU_BMPUSATD0              */
#define SMU_BMPUSATD0_LDMA_DEFAULT               (_SMU_BMPUSATD0_LDMA_DEFAULT << 2)           /**< Shifted mode DEFAULT for SMU_BMPUSATD0      */
#define SMU_BMPUSATD0_MVPAHBDATA0                (0x1UL << 3)                                 /**< MVPAHBDATA0 secure mode                     */
#define _SMU_BMPUSATD0_MVPAHBDATA0_SHIFT         3                                            /**< Shift value for SMU_MVPAHBDATA0             */
#define _SMU_BMPUSATD0_MVPAHBDATA0_MASK          0x8UL                                        /**< Bit mask for SMU_MVPAHBDATA0                */
#define _SMU_BMPUSATD0_MVPAHBDATA0_DEFAULT       0x00000001UL                                 /**< Mode DEFAULT for SMU_BMPUSATD0              */
#define SMU_BMPUSATD0_MVPAHBDATA0_DEFAULT        (_SMU_BMPUSATD0_MVPAHBDATA0_DEFAULT << 3)    /**< Shifted mode DEFAULT for SMU_BMPUSATD0      */
#define SMU_BMPUSATD0_MVPAHBDATA1                (0x1UL << 4)                                 /**< MVPAHBDATA1 secure mode                     */
#define _SMU_BMPUSATD0_MVPAHBDATA1_SHIFT         4                                            /**< Shift value for SMU_MVPAHBDATA1             */
#define _SMU_BMPUSATD0_MVPAHBDATA1_MASK          0x10UL                                       /**< Bit mask for SMU_MVPAHBDATA1                */
#define _SMU_BMPUSATD0_MVPAHBDATA1_DEFAULT       0x00000001UL                                 /**< Mode DEFAULT for SMU_BMPUSATD0              */
#define SMU_BMPUSATD0_MVPAHBDATA1_DEFAULT        (_SMU_BMPUSATD0_MVPAHBDATA1_DEFAULT << 4)    /**< Shifted mode DEFAULT for SMU_BMPUSATD0      */
#define SMU_BMPUSATD0_MVPAHBDATA2                (0x1UL << 5)                                 /**< MVPAHBDATA2 secure mode                     */
#define _SMU_BMPUSATD0_MVPAHBDATA2_SHIFT         5                                            /**< Shift value for SMU_MVPAHBDATA2             */
#define _SMU_BMPUSATD0_MVPAHBDATA2_MASK          0x20UL                                       /**< Bit mask for SMU_MVPAHBDATA2                */
#define _SMU_BMPUSATD0_MVPAHBDATA2_DEFAULT       0x00000001UL                                 /**< Mode DEFAULT for SMU_BMPUSATD0              */
#define SMU_BMPUSATD0_MVPAHBDATA2_DEFAULT        (_SMU_BMPUSATD0_MVPAHBDATA2_DEFAULT << 5)    /**< Shifted mode DEFAULT for SMU_BMPUSATD0      */
#define SMU_BMPUSATD0_RFECA0                     (0x1UL << 6)                                 /**< RFECA0 secure mode                          */
#define _SMU_BMPUSATD0_RFECA0_SHIFT              6                                            /**< Shift value for SMU_RFECA0                  */
#define _SMU_BMPUSATD0_RFECA0_MASK               0x40UL                                       /**< Bit mask for SMU_RFECA0                     */
#define _SMU_BMPUSATD0_RFECA0_DEFAULT            0x00000001UL                                 /**< Mode DEFAULT for SMU_BMPUSATD0              */
#define SMU_BMPUSATD0_RFECA0_DEFAULT             (_SMU_BMPUSATD0_RFECA0_DEFAULT << 6)         /**< Shifted mode DEFAULT for SMU_BMPUSATD0      */
#define SMU_BMPUSATD0_RFECA1                     (0x1UL << 7)                                 /**< RFECA1 secure mode                          */
#define _SMU_BMPUSATD0_RFECA1_SHIFT              7                                            /**< Shift value for SMU_RFECA1                  */
#define _SMU_BMPUSATD0_RFECA1_MASK               0x80UL                                       /**< Bit mask for SMU_RFECA1                     */
#define _SMU_BMPUSATD0_RFECA1_DEFAULT            0x00000001UL                                 /**< Mode DEFAULT for SMU_BMPUSATD0              */
#define SMU_BMPUSATD0_RFECA1_DEFAULT             (_SMU_BMPUSATD0_RFECA1_DEFAULT << 7)         /**< Shifted mode DEFAULT for SMU_BMPUSATD0      */
#define SMU_BMPUSATD0_SEEXTDMA                   (0x1UL << 8)                                 /**< SEEXTDMA secure mode                        */
#define _SMU_BMPUSATD0_SEEXTDMA_SHIFT            8                                            /**< Shift value for SMU_SEEXTDMA                */
#define _SMU_BMPUSATD0_SEEXTDMA_MASK             0x100UL                                      /**< Bit mask for SMU_SEEXTDMA                   */
#define _SMU_BMPUSATD0_SEEXTDMA_DEFAULT          0x00000001UL                                 /**< Mode DEFAULT for SMU_BMPUSATD0              */
#define SMU_BMPUSATD0_SEEXTDMA_DEFAULT           (_SMU_BMPUSATD0_SEEXTDMA_DEFAULT << 8)       /**< Shifted mode DEFAULT for SMU_BMPUSATD0      */

/* Bit fields for SMU BMPUFS */
#define _SMU_BMPUFS_RESETVALUE                   0x00000000UL                              /**< Default value for SMU_BMPUFS                */
#define _SMU_BMPUFS_MASK                         0x000000FFUL                              /**< Mask for SMU_BMPUFS                         */
#define _SMU_BMPUFS_BMPUFSMASTERID_SHIFT         0                                         /**< Shift value for SMU_BMPUFSMASTERID          */
#define _SMU_BMPUFS_BMPUFSMASTERID_MASK          0xFFUL                                    /**< Bit mask for SMU_BMPUFSMASTERID             */
#define _SMU_BMPUFS_BMPUFSMASTERID_DEFAULT       0x00000000UL                              /**< Mode DEFAULT for SMU_BMPUFS                 */
#define SMU_BMPUFS_BMPUFSMASTERID_DEFAULT        (_SMU_BMPUFS_BMPUFSMASTERID_DEFAULT << 0) /**< Shifted mode DEFAULT for SMU_BMPUFS         */

/* Bit fields for SMU BMPUFSADDR */
#define _SMU_BMPUFSADDR_RESETVALUE               0x00000000UL                              /**< Default value for SMU_BMPUFSADDR            */
#define _SMU_BMPUFSADDR_MASK                     0xFFFFFFFFUL                              /**< Mask for SMU_BMPUFSADDR                     */
#define _SMU_BMPUFSADDR_BMPUFSADDR_SHIFT         0                                         /**< Shift value for SMU_BMPUFSADDR              */
#define _SMU_BMPUFSADDR_BMPUFSADDR_MASK          0xFFFFFFFFUL                              /**< Bit mask for SMU_BMPUFSADDR                 */
#define _SMU_BMPUFSADDR_BMPUFSADDR_DEFAULT       0x00000000UL                              /**< Mode DEFAULT for SMU_BMPUFSADDR             */
#define SMU_BMPUFSADDR_BMPUFSADDR_DEFAULT        (_SMU_BMPUFSADDR_BMPUFSADDR_DEFAULT << 0) /**< Shifted mode DEFAULT for SMU_BMPUFSADDR     */

/* Bit fields for SMU ESAURTYPES0 */
#define _SMU_ESAURTYPES0_RESETVALUE              0x00000000UL                              /**< Default value for SMU_ESAURTYPES0           */
#define _SMU_ESAURTYPES0_MASK                    0x00001000UL                              /**< Mask for SMU_ESAURTYPES0                    */
#define SMU_ESAURTYPES0_ESAUR3NS                 (0x1UL << 12)                             /**< Region 3 Non-Secure                         */
#define _SMU_ESAURTYPES0_ESAUR3NS_SHIFT          12                                        /**< Shift value for SMU_ESAUR3NS                */
#define _SMU_ESAURTYPES0_ESAUR3NS_MASK           0x1000UL                                  /**< Bit mask for SMU_ESAUR3NS                   */
#define _SMU_ESAURTYPES0_ESAUR3NS_DEFAULT        0x00000000UL                              /**< Mode DEFAULT for SMU_ESAURTYPES0            */
#define SMU_ESAURTYPES0_ESAUR3NS_DEFAULT         (_SMU_ESAURTYPES0_ESAUR3NS_DEFAULT << 12) /**< Shifted mode DEFAULT for SMU_ESAURTYPES0    */

/* Bit fields for SMU ESAURTYPES1 */
#define _SMU_ESAURTYPES1_RESETVALUE              0x00000000UL                               /**< Default value for SMU_ESAURTYPES1           */
#define _SMU_ESAURTYPES1_MASK                    0x00001000UL                               /**< Mask for SMU_ESAURTYPES1                    */
#define SMU_ESAURTYPES1_ESAUR11NS                (0x1UL << 12)                              /**< Region 11 Non-Secure                        */
#define _SMU_ESAURTYPES1_ESAUR11NS_SHIFT         12                                         /**< Shift value for SMU_ESAUR11NS               */
#define _SMU_ESAURTYPES1_ESAUR11NS_MASK          0x1000UL                                   /**< Bit mask for SMU_ESAUR11NS                  */
#define _SMU_ESAURTYPES1_ESAUR11NS_DEFAULT       0x00000000UL                               /**< Mode DEFAULT for SMU_ESAURTYPES1            */
#define SMU_ESAURTYPES1_ESAUR11NS_DEFAULT        (_SMU_ESAURTYPES1_ESAUR11NS_DEFAULT << 12) /**< Shifted mode DEFAULT for SMU_ESAURTYPES1    */

/* Bit fields for SMU ESAUMRB01 */
#define _SMU_ESAUMRB01_RESETVALUE                0x0A000000UL                             /**< Default value for SMU_ESAUMRB01             */
#define _SMU_ESAUMRB01_MASK                      0x0FFFF000UL                             /**< Mask for SMU_ESAUMRB01                      */
#define _SMU_ESAUMRB01_ESAUMRB01_SHIFT           12                                       /**< Shift value for SMU_ESAUMRB01               */
#define _SMU_ESAUMRB01_ESAUMRB01_MASK            0xFFFF000UL                              /**< Bit mask for SMU_ESAUMRB01                  */
#define _SMU_ESAUMRB01_ESAUMRB01_DEFAULT         0x0000A000UL                             /**< Mode DEFAULT for SMU_ESAUMRB01              */
#define SMU_ESAUMRB01_ESAUMRB01_DEFAULT          (_SMU_ESAUMRB01_ESAUMRB01_DEFAULT << 12) /**< Shifted mode DEFAULT for SMU_ESAUMRB01      */

/* Bit fields for SMU ESAUMRB12 */
#define _SMU_ESAUMRB12_RESETVALUE                0x0C000000UL                             /**< Default value for SMU_ESAUMRB12             */
#define _SMU_ESAUMRB12_MASK                      0x0FFFF000UL                             /**< Mask for SMU_ESAUMRB12                      */
#define _SMU_ESAUMRB12_ESAUMRB12_SHIFT           12                                       /**< Shift value for SMU_ESAUMRB12               */
#define _SMU_ESAUMRB12_ESAUMRB12_MASK            0xFFFF000UL                              /**< Bit mask for SMU_ESAUMRB12                  */
#define _SMU_ESAUMRB12_ESAUMRB12_DEFAULT         0x0000C000UL                             /**< Mode DEFAULT for SMU_ESAUMRB12              */
#define SMU_ESAUMRB12_ESAUMRB12_DEFAULT          (_SMU_ESAUMRB12_ESAUMRB12_DEFAULT << 12) /**< Shifted mode DEFAULT for SMU_ESAUMRB12      */

